module.exports = {
    "auth" : "n1w15YFX|31TdEjjlJzYLv%G84M5Vp|h", // Авторизация
    "threads" : 2, // Количество потоков для каждого конкурента
    "delay" : 200,
    "min_percent" : 5, // Минимальный процент наценки
    "proxy" : "82.146.56.177:3022",
    "threads_competitor" : {
        "все инструменты" : 4
    },
    "favorite_competitor" : [
        "220 вольт",
        "все инструменты",
    ],
    "accumulate_competitor" : {
        "220 вольт" : 3,
        "все инструменты" : 3,
        "кувалда" : 3,
        "леруа мерлен" : 3,
        "бауцентр" : 2,
        "технопоинт" : 2,
        "днс" : 2,
        "арсенал трейдинг" : 2,
        "obi" : 2,
        "ситилинк" : 2,
        "ozon" : 2,
        "котофото" : 2,
    }
}