module.exports = {
    "auth" : "n1w15YFX|31TdEjjlJzYLv%G84M5Vp|h", // Авторизация
    "threads" : 1, // Количество потоков для каждого конкурента
    "delay" : 200,
    "min_percent_internet" : 5, // Минимальный процент наценки 
    "min_percent_retail" : 10, // Минимальный процент наценки 
    "proxy" : "82.146.56.177:3022",
    "threads_competitor" : {
        "все инструменты" :2,
        "220 вольт" : 2,
        "технопоинт" : 2,
    },
    "favorite_competitor" : [
        "220 вольт",
        "все инструменты",
        "кувалда"
    ],
    "accumulate_competitor" : {
        "220 вольт" : 2,
        "все инструменты" :2,
        "беру" : 2,
        "кувалда" : 1,
        "леруа мерлен" :1,
        "технопоинт" : 2,
        "арсенал трейдинг" : 2,
        "ситилинк" : 2,
        "ozon" : 2,
    }

}