module.exports = {
    "auth" : "n1w15YFX|31TdEjjlJzYLv%G84M5Vp|h", // Авторизация
    "threads" : 2, // Количество потоков для каждого конкурента
    "delay" : 200,
    "min_percent" : 5, // Минимальный процент наценки
    "proxy" : "82.146.56.177:3022",
    "threads_competitor" : {
        "все инструменты" : 4,
        "все инструменты" : 4,
        //"технопоинт" : 2,
    },
    "favorite_competitor" : [
        "220 вольт",
        "все инструменты",
        "кувалда"
    ],
    "accumulate_competitor" : {
        "220 вольт" : 3,
        "все инструменты" : 3,
        "беру" : 2,
        //"кувалда" : 2,
        //"леруа мерлен" :2,
        //"технопоинт" : 2,
        //"арсенал трейдинг" : 2,
        //"ситилинк" : 2,
        "ozon" : 2,
    }

}