const path = require('path');
const root_path = path.dirname(require.main.filename || process.mainModule.filename);


//------------------------------------------------------//
module.exports = (async function(sheet) {

    let position = 9;
    sheet[0].forEach(function(element,index){
        if (element.toLowerCase() == "код поставщика") {position = index+1;}
    });

    let result = [];
    for (let i = 0; i < sheet.length; i++) {
        let index = 0;
        result[i] = [];

        for (let j = 0; j < position; j++) {
            result[i][index++] = sheet[i][j];
        }


        result[i][index++] = i!=0 ? '' : "Остаток";
        result[i][index++] = i!=0 ? '' : "Дата";
        result[i][index++] = i!=0 ? '' : "Цена закупки";
        result[i][index++] = i!=0 ? '' : "Цена продажная";
        result[i][index++] = i!=0 ? '' : "Цена продажная (*)";

        result[i][index++] = i!=0 ? '' : "ИМ - Минимальная";
        result[i][index++] = i!=0 ? '' : "ИМ - Минимальная Актуальная";
        result[i][index++] = i!=0 ? '' : "Розница - Минимальная";
        result[i][index++] = i!=0 ? '' : "Розница - Минимальная актуальная";

        result[i][index++] = i!=0 ? '' : "ИМ - Рекомендованная (В наличии + избранное)";
        result[i][index++] = i!=0 ? '' : "ИМ - Актуальная рекомендованная (В наличии + избранное)";
        result[i][index++] = i!=0 ? '' : "Розница - Рекомендованная (В наличии + избранное)";
        result[i][index++] = i!=0 ? '' : "Розница - Рекомендованная актуальная (В наличии + избранное)";

        result[i][index++] = i!=0 ? '' : "ИМ - Рекомендованная (в наличии)";
        result[i][index++] = i!=0 ? '' : "ИМ - Актуальная рекомендованная (в наличии)";
        result[i][index++] = i!=0 ? '' : "Розница - Рекомендованная (в наличии)";
        result[i][index++] = i!=0 ? '' : "Розница - Рекомендованная актуальная (в наличии)";

        result[i][index++] = i!=0 ? '' : "ИМ - Рекомендованная (в наличии и под заказ)";
        result[i][index++] = i!=0 ? '' : "ИМ - Актуальная рекомендованная (в наличии и под заказ)";
        result[i][index++] = i!=0 ? '' : "Розница - Рекомендованная (в наличии и под заказ)";
        result[i][index++] = i!=0 ? '' : "Розница - Рекомендованная актуальная (в наличии и под заказ)";

        result[i][index++] = i!=0 ? '' : "ИМ - Рекомендованная (все)";
        result[i][index++] = i!=0 ? '' : "ИМ - Актуальная рекомендованная (все)";
        result[i][index++] = i!=0 ? '' : "Розница - Рекомендованная (все)";
        result[i][index++] = i!=0 ? '' : "Розница - Рекомендованная актуальная (все)";

        result[i][index++] = i!=0 ? '' : "Минимальная цена конкурента (В наличии + избранное)";
        result[i][index++] = i!=0 ? '' : "Минимальная цена конкурента (В наличии)";
        result[i][index++] = i!=0 ? '' : "Минимальная цена конкурента (В наличии и под заказ)";
        result[i][index++] = i!=0 ? '' : "Минимальная цена конкурента (Все)";

        result[i][index++] = i!=0 ? '' : "Конкуренты с меньшей ценой (В наличии + избранное)";
        result[i][index++] = i!=0 ? '' : "Конкуренты с меньшей ценой (В наличии)";
        result[i][index++] = i!=0 ? '' : "Конкуренты с меньшей ценой (В наличии + под заказ)";
        result[i][index++] = i!=0 ? '' : "Конкуренты с меньшей ценой (Все)";

        result[i][index++] = i!=0 ? '' : "Конкуренты с меньшей ценой РРЦ (В наличии + избранное)";
        result[i][index++] = i!=0 ? '' : "Конкуренты с меньшей ценой РРЦ (В наличии)";
        result[i][index++] = i!=0 ? '' : "Конкуренты с меньшей ценой РРЦ (В наличии + под заказ)";
        result[i][index++] = i!=0 ? '' : "Конкуренты с меньшей ценой РРЦ (Все)";

        result[i][index++] = i!=0 ? '' : "*"; 

        for (let j = position; j < sheet[i].length; j++) {
            result[i][index++] = sheet[i][j];
        }



    }
    return result;
});
//------------------------------------------------------//